{
  "introduction": [
    {
      "type": "title",
      "text": "Know God Better"
    },
    {
      "type": "heading",
      "text": "Introduction"
    },
    {
      "type": "paragraph",
      "text": "Christians speak easily about the \"attributes of God\", but we often treat them as if they were items in a list: holiness here, love there, power somewhere else — each capable of being described in isolation and then mentally added together to give a picture of God."
    },
    {
      "type": "paragraph",
      "text": "This resource is built on a different conviction:"
    },
    {
      "type": "paragraph",
      "text": "God is not the sum of His attributes. He is the unity of them."
    },
    {
      "type": "paragraph",
      "text": "Every attribute of God is fully God. Every attribute is shaped and coloured by every other attribute. God’s love is holy love; His holiness is loving holiness. His power is wise power; His wisdom is powerful wisdom. None of His attributes exists in isolation, and none can be properly understood on its own."
    },
    {
      "type": "paragraph",
      "text": "To treat them as separable is convenient, but it is misleading."
    },
    {
      "type": "heading",
      "text": "God's glory: one light, many colours"
    },
    {
      "type": "paragraph",
      "text": "White light appears simple, but it is not. When passed through a prism, it is revealed to be a rich spectrum of colours — each distinct, yet inseparable from the whole."
    },
    {
      "type": "paragraph",
      "text": "In a similar way, God's being is one, simple, indivisible reality. What we call His \"attributes\" are not parts of Him, but different ways in which His one being is revealed and encountered. Each attribute is a true disclosure of who God is, yet none exhausts Him."
    },
    {
      "type": "paragraph",
      "text": "For this reason the attributes of God cannot simply be added together. They interpenetrate."
    },
    {
      "type": "paragraph",
      "text": "Each one gives depth, shape, and meaning to all the others. Together they form not a list, but a living unity — a harmony rather than a heap. This living unity of attributes is what we mean when we speak of God's \"glory\"."
    },
    {
      "type": "heading",
      "text": "Infinity, Immutability, Trinity, Spirit"
    },
    {
      "type": "paragraph",
      "text": "Infinity is not listed here as a separate attribute, but is a characteristic of all of them. This is made clear by prefixes in \"omni-\" and words such as \"perfectly\", \"completely\", \"totally\", \"fully\" … and indeed \"infinitely\"."
    },
    {
      "type": "paragraph",
      "text": "Similarly, immutability is not listed as a separate attribute, expressing as it does the fact that what God is, He always and forever is. None of God's attributes changes over time: \"I am who I am\"."
    },
    {
      "type": "paragraph",
      "text": "Third, it is beyond the scope of this app to explore the doctrine of the Trinity, as true and fundamental as it is. It is not so much an attribute of God as the unique constitution of the God whose attributes we are exploring. However, it is important to keep in mind that every attribute is equally true of our Father, His Son King Jesus and their beloved Holy Spirit."
    },
    {
      "type": "paragraph",
      "text": "Fourth, we note that the triune God is Spirit. Although we cannot avoid using anthropomorphic expressions when we attempt to describe Him, we understand that He is not limited by a physical constitution, physical senses or physical means of expression."
    },
    {
      "type": "heading",
      "text": "Love at the centre"
    },
    {
      "type": "paragraph",
      "text": "Scripture tells us not merely that God loves, but that God is love."
    },
    {
      "type": "paragraph",
      "text": "This implies that love is not just one attribute among others, but neither does it override or soften the rest. Rather, love is the personal, self-giving orientation of God’s whole being. Every attribute in this resource is therefore presented as a revelation of love:"
    },
    {
      "type": "list",
      "items": [
        "Holiness is the purity of love",
        "Justice is the protection of love",
        "Wisdom is the understanding of love",
        "Omnipotence is the power of love to accomplish its purposes"
      ]
    },
    {
      "type": "paragraph",
      "text": "Seen this way, love does not flatten the attributes; it intensifies them."
    },
    {
      "type": "heading",
      "text": "How the Attributes Relate"
    },
    {
      "type": "paragraph",
      "text": "When we describe God, we are forced to speak in parts. Human language has no other way in. We talk about love, holiness, power, wisdom, justice — one word at a time — not because God comes in pieces, but because we do."
    },
    {
      "type": "paragraph",
      "text": "The danger is obvious: we begin to imagine that God is built up from these attributes, as though each one were a separate component that could be examined on its own and then bolted together with the rest."
    },
    {
      "type": "paragraph",
      "text": "That is not how God is. His attributes do not stack up like bricks. They interact."
    },
            {
      "type": "paragraph",
      "text": "Each attribute shapes every other attribute. Change one, and you have changed the whole. Remove one, and you no longer have the God of Scripture at all."
    },
    {
      "type": "paragraph",
      "text": "God’s love is never bare love — it is holy love, wise love, powerful love, faithful love. God’s holiness is never sterile — it is loving holiness, gracious holiness, life-giving holiness."
    },
    {
      "type": "paragraph",
      "text": "This means that knowing more attributes does not merely increase information; it increases depth. Each additional attribute multiplies understanding rather than simply adding to it."
    },
    {
      "type": "paragraph",
      "text": "In short: God is not clearer when simplified. He is clearer when seen whole."
    },

    {
      "type": "heading",
      "text": "Why this matters"
    },
    {
      "type": "paragraph",
      "text": "Many theological errors arise not from denying an attribute, but from isolating it."
    },
    {
      "type": "list",
      "items": [
        "Love detached from holiness becomes indulgence.",
        "Power detached from goodness becomes tyranny.",
        "Justice detached from mercy becomes cruelty.",
        "Sovereignty detached from love becomes fate."
      ]
    },
    {
      "type": "paragraph",
      "text": "Scripture never makes these separations, even when we are tempted to."
    },
    {
      "type": "heading",
      "text": "Why alphabetical order"
    },
    {
      "type": "paragraph",
      "text": "The order of presentation carries no ranking."
    },
    {
      "type": "paragraph",
      "text": "God is not more loving than faithful, nor more holy than wise. Alphabetical order is a practical discipline: it prevents us from smuggling a hierarchy into the structure and forces us to let Scripture, not sequence, do the work."
    },
    {
      "type": "heading",
      "text": "What this invites"
    },
    {
      "type": "paragraph",
      "text": "This way of seeing God does not reward speed. It rewards attentiveness."
    },
    {
      "type": "paragraph",
      "text": "You are not meant to master the material, but to be formed by it — to notice how one truth deepens another, and how together they draw you not towards abstraction, but towards worship."
    },
    {
      "type": "paragraph",
      "text": "This is not about organising God neatly — it is about knowing Him truly, as He has made Himself known."
    },
{
      "type": "heading",
      "text": "How this resource is structured"
    },
    {
      "type": "paragraph",
      "text": "The large coloured icon on the launch page takes you to a grid of 25 coloured dots, each associated with an attribute of God. Clicking or tapping on any of them takes you to the main page for that attribute." 
    },
    {
      "type": "paragraph",
      "text": "Each attribute page is structured in the same way: a short love-related strapline, a single-line summary, a formal definition, an explanatory comment and some brief pointers to common misconceptions." 
    },
    {
      "type": "paragraph",
      "text": "At the bottom of each attribute page is a link to a pop-up text box containing a few of the many relevant Scripture passages. These are quoted from The Holy Bible, New International Version (Anglicised)" 
    },
    {
      "type": "heading",
      "text": "How to use this resource"
    },
    {
      "type": "paragraph",
      "text": "This is not designed as a daily devotional or a linear course. It is a reference tool — something to return to, linger over, and think with."
    },
    {
      "type": "list",
      "items": [
        "Attributes are listed alphabetically, not hierarchically.",
        "Each attribute is marked with a colour, reflecting its (arbitrary) place in the spectrum.",
        "Cross-references are intentional and unavoidable: this mirrors reality rather than tidying it up.",
        "A separate reflection page offers a small, refreshable random selection of attributes for prayerful consideration — not to rush, but to slow down."
      ]
    },
    {
      "type": "paragraph",
      "text": "When you have finished reading this Introduction, you may wish to visit the Attributes page. Tap an attribute and spend some time exploring its definition, Scripture references, and other content. "
    },
    {
      "type": "paragraph",
      "text": "Once you have explored all the attributes, you may like to visit the Reflection page, where you can spend some time reflecting on the connections between a small selection of attributes. Each time you visit the page a new selection of attributes will appear"
    },
    {
      "type": "paragraph",
      "text": "The aim is simple, and unapologetic: To know God better — and to help people who want to know God better, know God better."
    }
  ]
}
