{
    "randomMusings": [
    {
      "type": "title",
      "text": "Know God Better"
    },
    {
      "type": "heading",
      "text": "Random Musings"
     },
    {
      "type": "paragraph",
      "text": "The following musings should not be thought of in the same category as the definitions of God's various attributes. They are just some ideas that have come to me in the process of meditating and praying over those attributes and their possible implications. So, take them or leave them. Perhaps they will stimulate your own thinking. You might continue along the same lines of thought or you might develop contrasting ways of seeing the issues involved. "
    },
    {
      "type": "heading",
      "text": "Not a Force but a Person"
    },
    {
      "type": "paragraph",
      "text": "It should go without saying that God is not an impersonal 'force' or 'principle' but a Person Who wills and chooses and acts and responds and loves and hates. This is implicit in His attribute of ●Freedom."
    },
    {
      "type": "heading",
      "text": "Matter and Spirit"
    },
    {
      "type": "paragraph",
      "text": "The entire space-time continuum comprising everything we can in principle observe and measure, including 'dark' matter and energy, is mere 'stuff' - created and subject to entropy. God alone is ●Uniquely uncreated Spirit, and ●Eternal."
    },
    {
      "type": "heading",
      "text": "Each Person of the Trinity is equally glorious"
    },
    {
      "type": "paragraph",
      "text": "Every one of these attributes is true of the triune God and also of each person of the Godhead - Father, Son and Holy Spirit - at all times and in every place. The Son is now gloriously embodied as a human, but retains all His divine attributes, even ●Omnipresence - “surely I am with you always, to the very end of the age” [Matthew 28:20 NIV (UK)]; “The Son is the radiance of God's glory and the exact representation of his being” [Hebrews 1:3 NIV (UK)]."
    },
   
    {
      "type": "heading",
      "text": "God is Love"
    },
    {
      "type": "paragraph",
      "text": "Since our Father is ●Love, everything that is true about our Father is also true about His love. As He is not subject to entropy, so love is the one source of energy that never runs dry. In fact, the more it is given away the more there is. God's Love is ●Beautiful, ●Creative, ●Eternal, ●Extravagant, ●Faithful, ●Forgiving, ●Free, ●Gracious, ●Good, ●Holy, ●Joyous, ●Just, ●Life-giving, ●Merciful, ●Omnipotent, ●Omnipresent, ●Omniscient, ●Patient, ●Peace-filled, ●Sovereign, ●Transcendent, ●True, ●Unique and ●Wise."
    },
    {
      "type": "heading",
      "text": "The humility of God"
    },
    {
      "type": "paragraph",
      "text": "At the very heart of God's being lies what we perceive as humility.  He 'made Himself nothing' in becoming human and going to the cross for our sakes. Yet this is not in itself an attribute of God, but an outworking, in His relationship with us, of such attributes as His ●Faithfulness, ●Forgiveness, ●Grace, ●Love, ●Mercy, ●Peace and ●Wisdom. God is sufficiently secure in His glory that He does not need to stand on His dignity."
    },
   
    {
      "type": "heading",
      "text": "Expanding our minds"
    },
    {
      "type": "paragraph",
      "text": "We do not presume to 'get our minds round' our Father God but to expand our minds as we develop some appreciation of His being - “And these are but the outer fringe of his works; how faint the whisper we hear of him! Who then can understand the thunder of his power?” [Job 26:14 NIV (UK)]"
    },
       {
      "type": "heading",
      "text": "Not putting ourselves down"
    },
    {
      "type": "paragraph",
      "text": "Humility before our Father is not found so much in putting ourselves down as in lifting our hearts and minds up to His glory."
    },
    {
      "type": "heading",
      "text": "Reflecting God’s glory"
    },
    {
      "type": "paragraph",
      "text": "We progressively (and imperfectly) reflect our Father's glory and build our character as we recognise our dependence on Him and draw on each of His attributes by faith."
    },
       {
      "type": "heading",
      "text": "God in time?"
    },
    {
      "type": "paragraph",
      "text": "Our Father God may have chosen to enter time, but then, He created it. Time is our master but His tool."
    },
    
    {
      "type": "heading",
      "text": "Omnipresent in time"
    },
    {
      "type": "paragraph",
      "text": "Our Father's ●Omnipresence and ●Eternity - the fact that He neither begins nor ceases to be present in any part of the universe - imply His omnipresence in time as well. Even the observable universe extends in every direction for some 13.8 billion light years, and the actual universe is surely many times bigger. If God is present throughout the universe, we can hardly suppose that He cannot relate to Himself from one end of it to the other. Thus He is (not ‘was’, not ‘will be’) equally present to us and to all generations of the human race throughout all time."
    },
    {
      "type": "heading",
      "text": "Truth and Goodness"
    },
    {
      "type": "paragraph",
      "text": "●Truth and ●Goodness: is something good because our Father God says so (implying that good and evil are arbitrary), or does He say it because it is good (implying that He obeys some higher standard of good outside Himself)? Neither. Our Father is the Ultimate Reality and everything He says is a true and ●Faithful expression of His being. What He says is good is good because He is good. As ●Truth corresponds factually to Ultimate Reality, so ●Goodness corresponds morally to Ultimate Reality."
    },
    {
      "type": "heading",
      "text": "Freedom and self-control"
    },
    {
      "type": "paragraph",
      "text": "There are two kinds of self-control: First, we purposefully direct our minds or limbs towards a task such as reading a book, or hammering a nail. Second, we restrain ourselves from reacting inappropriately to something that offends us, hurts our pride, disgusts, frightens or angers us. When we say that God's ●Freedom means that He has no need to exercise self-control, we refer to the second kind of self-control. God of course exercises the first, but He does not need to exercise the second."
    },  
    {
      "type": "heading",
      "text": "Free to be Himself"
    },
    {
      "type": "paragraph",
      "text": "In His ●Freedom our Father God is free to be what He is in Himself, not what He is not. So, He is free to be ●Faithful, ●Good, ●Holy, ●Just, at ●Peace, ●Sovereign, ●True, ●Unique and ●Wise. But He is not free to be capricious, evil, unfair, anxious, helpless, mendacious, generic or foolish - “if we are faithless, he will remain faithful, for he cannot disown himself” [2 Timothy 2:13 NIV (UK)]; '... God cannot be tempted by evil ...' [James 1:13 NIV (UK)]."
    },
    {
      "type": "heading",
      "text": "Free to withhold "
    },
    {
      "type": "paragraph",
      "text": "In His ●Freedom our Father God is free to respond appropriately to human behaviour in line with His ●Justice, ●Love and ●Wisdom. This may lead Him temporarily to withhold expressions of His ●Forgiveness, ●Grace or ●Mercy in the service of His loving desire for all human beings to be in a right relationship with Him."
    },  
    {
      "type": "heading",
      "text": "God's 'absence' leads to 'hell'"
    },
    {
      "type": "paragraph",
      "text": "Our Father is ●Freely ●Omnipresent in His ●Goodness.  We understand that there is a 'place' or 'state' where He freely chooses not to be present and where His goodness is no longer accessible.  We call that place hell."
    },
    {
      "type": "heading",
      "text": "God's 'forgetfulness' leads to 'heaven'"
    },
    {
      "type": "paragraph",
      "text": "Our Father is ●Freely ●Omniscient in His ●Mercy.  We understand from Scripture that there are some things which He freely chooses not to retain in His consciousness. Among them are all the sins of believers who through Christ's death on the cross have been ●Forgiven. This, along with our transformation into His likeness, makes it possible for sinful human beings to be in His presence (commonly referred to as 'heaven')."
    },  
    {
      "type": "heading",
      "text": "The Great Lie"
    },
    {
      "type": "paragraph",
      "text": "Our Father is the Ultimate Reality, the One Great ●Truth that has been revealed to us. The Great Lie is the assertion that human beings can be truly themselves, fulfil their destiny or find their ultimate good in anything or anyone else. Anyone who opposes, denies, contradicts, obscures, distorts, misrepresents, refuses to acknowledge, tries to evade, ignores, despises, derides, discounts, adds to or sets up any alternative to Ultimate Reality is party to the Great Lie."
    },
    {
      "type": "heading",
      "text": "Ultimate Morality"
    },
    {
      "type": "paragraph",
      "text": "Just as our Father God is the Ultimate Reality, He is also the Ultimate Morality. The comments made about those who oppose Ultimate Reality apply equally to those who oppose Ultimate Morality. ●Truth is inseparable from ●Justice. God's ●Holiness bears the same relationship to morality as His ●Transcendence bears to reality."
    },  
    {
      "type": "heading",
      "text": "Objective Morality"
    },
    {
      "type": "paragraph",
      "text": "All sin, whether self-exaltation, oppression, betrayal, theft, deception or idolatry (the underlying attitudes and behaviours forbidden in the Ten Commandments), has at its heart the embracing of an untruth, the substitution of a lie for the ●Truth of ultimate reality. Since therefore sin can be defined in terms of its relationship to ultimate reality, so can morality. This in turn indicates that morality is objective and not subjective."
    },
    {
      "type": "heading",
      "text": "Truth Incarnate"
    },
    {
      "type": "paragraph",
      "text": "Our Father God is ●Truth, the Ultimate Reality. Jesus, while on earth, was Truth incarnate, the Ultimate Reality transposed into flesh and blood within the space-time continuum. He was a true expression of our Father within those constraints, but the parameters of space, time and humanity limited the extent to which Ultimate Reality could be expressed. An attempted analogy would be a magnificent symphony written for a full orchestra, which is then transposed for and played by a single piano.  Much of the richness, variety and depth of the symphony must be given up, but what the piano plays accurately expresses, within the natural limitations of the instrument, its rhythm, theme, chording, light and shade, melody, tempo and cadences."
    },      
    {
      "type": "heading",
      "text": "A war God wins"
    },
    {
      "type": "paragraph",
      "text": "In infiltrating the world as ●Truth incarnate, our Father God declared war on the dark and rebellious powers behind the Great Lie and all the evil and suffering arising from it. It is a war He wins and we are by nature on the enemy side and heading for death. But He gives us the option to join His side in Christ, as we daily identify with Him in His death. And having raised Christ to life, He promises us resurrection on Victory Day, while the Spirit of Christ in us enables us now to live to our Father's glory as effective eternal agents for ●Truth and ●Good. "
    },
    {
      "type": "heading",
      "text": "Joining God's side"
    },
    {
      "type": "paragraph",
      "text": "As we 'identify with Jesus in His death' we figuratively put to death our sinful nature, and are figuratively resurrected as the Spirit gradually transforms us into Christ's likeness. The more closely we identify with Jesus, humbling our pride, the more closely we are transformed into His likeness. Then, when we literally die, and we see Him as He is, pride vanishes, and we are literally resurrected and become truly like Him."
    },  
{
      "type": "heading",
      "text": "We shall be like Him"
    },
    {
      "type": "paragraph",
      "text": "Given all that we have learned about God's glory, it is astounding to think that we “are being transformed into his image with ever-increasing glory” [2 Corinthians 3:18] NIV (UK); and that when He appears and we see Him as He is, “we shall be like Him” [1 John 3:2 NIV (UK)]."
    },
    {
      "type": "heading",
      "text": "A Mathematical Whimsy"
    },
    {
      "type": "paragraph",
      "text": "I think of our Father's glory as not just the sum but the factorial product of His attributes, as each is shaped and coloured by all the others. By factorial product, I mean the product of 'multiplying' one attribute by the next and then 'multiplying' the result of that operation by the next attribute, and so on.  A numerical analogy would be 25 x 24 x 23 x 22 … x 1, the result of which (approximately 15.5 billion trillion or 15,500,000,000,000,000,000,000,000) is enormously greater than 25 + 24 + 23 + 22 … + 1 (325). When in whimsical mood I sometimes think of it as the 'exponential product' of His attributes. The numerical analogy here is 25 ^ 24 ^ 23 ^ 21 … ^ 1, where the symbol '^' means 'raised to the power of'. Carrying out this calculation even for the first three elements (expressed, strictly speaking, as 25 ^ (24 ^ 23)) results in a number so impossibly huge that it vastly exceeds the number of sub-atomic particles in a hypothetical multiverse consisting of as many of our universes as our universe contains subatomic particles. That's a very large number, considering that there are estimated to be 328 million trillion trillion trillion trillion trillion trillion subatomic particles just in our own observable universe (https://www.popularmechanics.com/space/a27259/how-many-particles-are-in-the-entire-universe/). However, it is swamped by the result of just the first three elements of the calculation, which is impossible to write out, as it has over 7.7 x 10^28 digits. To give you an idea, if you printed 2,500 digits on each sheet it would take a stack of A4 paper 325,000 light-years high just to write out the 0's. Interestingly, though, if you tackle the same calculation starting from the other end (1 ^ 2 ^3 … ^ 25), the result is always just 1 … hmmm."
    }, 
        {
      "type": "heading",
      "text": "A Prayer of Praise"
    },
    {
      "type": "paragraph",
      "text": "Praise be to You, O LORD, God of our father Israel, and Father of our Lord Jesus Christ, from everlasting to everlasting."
    },
    {
      "type": "paragraph",
      "text": "Yours, O LORD, is the greatness and the power and the glory and the majesty and the splendour, for everything in heaven and earth is Yours, for You created all things, and by Your will they were created and have their being."
    },
        {
      "type": "paragraph",
      "text": "In Your hands are strength and power to exalt and give strength to all, and everything You want me to do I am able to do through Christ who strengthens me."
    },
    {
      "type": "paragraph",
      "text": "Wealth and honour come from You; health and wholeness come from You; love and laughter come from You; You are the ruler of all things. Every good thing comes from You. Everything that comes from You is good. In everything that comes to me, You are good, and everything my heart desires is found in You."
    },
    {
      "type": "paragraph",
      "text": "In Your hands are strength and power to exalt and give strength to all, and everything You want me to do I am able to do through Christ who strengthens me."
    },
    {
      "type": "paragraph",
      "text": "And now, O God, I give You thanks, and praise Your glorious name, I AM WHO I AM, Father, Son and Holy Spirit, from everlasting to everlasting. Amen"
    }
  ]
} 











